[display]
width = 800
height = 600

[version]
version = 9.0.1.1

[section]
id = 200000

[zone_server]
num = 1

[zone_session]  	;和ZoneServer通信参数
port = 5050		;和LoongWorld通信的端口

[player_session] 	;和客户端通信参数
port = 4200	 	;和客户端通信的端口

[zone0]
id = 200001		;游戏世界ID
name = Origins		;游戏世界名称
auto_seal = 1		;反外挂程序是否自动封号
attachserver=		;附属world服务，多个用，隔开


[database]
ip	= 127.0.0.1
user	= root		;用户名
psd	= 		;密码
name	= loong_login
port    = 3306

[world_state]
update_time = 5;	;世界人数状态DB更新时间（毫秒）
insert_time = 36

[sim_fatigueserver]
switch	=	0

[gm_server]
ip = 127.0.0.1		;GMServerIP
port = 6600		;GMServer端口

[golden_code]
login_server = 300	;LoginServer的金色代码
zone_server =  292	;LoongWorld的金色代码

[proof]
policy = 0		;验证策略，0——普通策略 

[fatigue_guard]
;海外：不模拟防沉迷服务器，不开启防沉迷
;外服：不模拟防沉迷服务器，开启防沉迷
;精英：模拟防沉迷服务器，开启防沉迷

sim_server	= 0  ;模拟防沉迷服务器
guard_switch	= 0  ;防沉迷开关

;下面选项是防沉迷服务器相关的设置，只有在开启防沉迷时有效
ip	=	127.0.0.1	;防沉迷服务器的ip
port	=	9999		;防沉迷服务器的端口
circle =	60		;（ 单位 秒）向fatigue_server发所有当前在线防沉迷玩家帐号的周期

[quanquan]
;盛大圈圈都用，其他模式不需这个部分
billingip = 127.0.0.1
;UDP server IP
billingport = 5001
;UDP port

